# Создайте класс "Здание" с атрибутами "адрес" и "количество этажей". Напишите
#метод, который выводит информацию о здании в формате "Адрес: адрес, Количество
#этажей: этажи".



# ==============================================================================
# Класс "Здание"
# ==============================================================================


class Building:
    """Класс, описывающий здание с адресом и этажностью."""

    def __init__(self, address: str, floors_count: int):
        """Конструктор для инициализации атрибутов здания."""
        self.address = address  # Атрибут "адрес"
        self.floors_count = floors_count  # Атрибут "количество этажей"

    def display_info(self):
        """Метод для вывода информации о здании в строго заданном формате."""
        print(f"Адрес: {self.address}, Количество этажей: {self.floors_count}")


# ==============================================================================
# ТЕСТОВЫЙ ЗАПУСК ПРОГРАММЫ
# ==============================================================================
if __name__ == "__main__":
    print("--- Проверка работы класса 'Здание' ---")

    # Создаем два объекта зданий для теста
    building_1 = Building("ул. Ленина, д. 10", 5)
    building_2 = Building("пр. Космонавтов, д. 45", 12)

    # Вызываем метод вывода информации
    building_1.display_info()
    building_2.display_info()


